<style  type="text/css"> 
</style>

<b><center>
<span style="font-size: 24pt; line-height: 1.2">
COMS W4111-002 (Fall 2021)<br>Introduction to Databases
</span>
</center></b>
</span><br>
<p>
<i><center>
<span style="font-size: 20pt; line-height: 1.2">
Homework 1: Non-Programming - 10 Points
</span>
</center></i>

__Note:__ Please replace the information below with your last name, first name and UNI.<br><br>



<i>
<span style="font-size: 20pt; line-height: 1.2"; >
LastName_FirstName, UNI
</span>
</i>

## Introduction

### Objectives
This homework has you practice and build skill with:

- PART A: (1 point) Understanding relational databases
- PART B: (1 point) Understanding relational algebra
- PART C: (2 points) Loading data
- PART D: (2 points) Cleaning data using SQL and pandas
- PART E: (4 points) Performing SQL queries to analyze the data



### Submission
1. File > Print Preview > Download as PDF
2. Upload .pdf and .ipynb to GradeScope


**This assignment is due September 24, 11:59 pm ET**


### Collaboration
- You may use any information found in TA or Prof. Ferg's office hours
- You are not allowed to collaborate outside of office hours
- You are NOT allowed to collaborate with other students outside of office hours.

# Part A: Written

1. What is a database management system?

    <i> Your answer here </i>

2. What is a primary key and why is it important?

    <i> Your answer here </i>

3. Please explain the differences between SQL, MySQL Server and DataGrip?

    <i> Your answer here </i>

4. What are 4 different types of DBMS table relationships, give a brief explanaition for each?

    <i> Your answer here </i>

5. What is an ER model? 

    <i> Your answer here </i>

6. Using Lucidchart draw an example of a logical ER model using Crow's Foot notation for Columbia classes. The entity types are:
    - Students, Professors, and Classes.
    - The relationships are:
        - A Class has exactly one Professor.
        - A Student has exactly one professor who is an _advisor._
        - A Professor may advise 0, 1 or many Students.
        - A Class has 0, 1 or many enrolled students.
        - A Student enrolls in 0, 1 or many Classes.
        
        
- You can define what you think are common attributes for each of the entity types. Do not define more than 5 or 6 attributes per entity type.


- In this example, explicitly show an example of a primary-key, foreign key, one-to-many relationship, and many-to-many relationship.


__Notes:__
- If you have not already done so, please register for a free account at Lucidchart.com. You can choose the option at the bottom of the left pane to add the ER diagram shapes.
- You can take a screen capture of you diagram and save in the zip directory that that contains you Jupyter notebook. Edit the following cell and replace "Boromir.jpg" with the name of the file containing your screenshot.
    
    

   <i> Use the following line to upload a photo of your Luicd Chart <i/>
   <img src="Boromir.jpg">

# Part B: Relational Algebra

You will use [the online relational calculator](https://dbis-uibk.github.io/relax/landing), choose the “Karlsruhe University of Applied Sciences” dataset.

An anti-join is a form of join with reverse logic. Instead of returning rows when there is a match (according to the join predicate) between the left and right side, an anti-join returns those rows from the left side of the predicate for which there is no match on the right. 

The Anti-Join Symbol is ▷.

Consider the following relational algebra expression and result.

/* (1) Set X = The set of classrooms in buildings Taylor or Watson. */

        X = σ building='Watson' ∨ building='Taylor' (classroom)

/* (2) Set Y =  The Anti-Join of department and X */

        Y = (department ▷ X)

/* (3) Display the rows in Y. */

        Y
        
   <img src="ra.png">

1. Find an alternate expression to (2) that computes the correct answer given X. Display the execution of your query below.

    <i>Your screenshot here </i>

## Part C: Loading Data

In this section we are going to work through loading data from CSV files to pandas DataFrames to SQL tables. You only need to write two lines of code for this entire section, and they can <a href="https://pandas.pydata.org/pandas-docs/stable/reference/frame.html">be found within the pandas documentation</a>

### Step 1: CSV to Pandas DataFrame

Loading data from files in various formats into Python data structures and databases for processing and analysis is extremely common.
Complete the following code fragment. Only one line of code is required here. This fragment should load data from a CSV file into a Pandas data frame.Hint: use the file path

In [69]:
csv_files = ['flavors', 'generic-food']
dfs = {}
for f in csv_files:
    fn = "./Data/" + f + ".csv"
    
    ###### Your Code Goes Here #####
    

        
    ##### End Code #####
    dfs[f] = df

    print("Loaded file " + f)

Loaded file flavors
Loaded file generic-food

### Tests

The next cells print the first 5 rows in each dataframe to help you confirm that you loaded the data. Your execution should produce the same answer as the cells below. Remember, your execution will overwrite the ones in this notebook. So, you should make a copy of the correct answers for comparison.

In [70]:
for k,v in dfs.items():
    print ("\n\n************* Data for dataframe = ", k, "*************\n")
    print (v.head(5))

************* Data for dataframe =  flavors *************

          FOOD    FLAVOUR
0       celery  vegetable
1         corn  vegetable
2     cucumber  vegetable
3  horseradish  vegetable
4    vegetable  vegetable


************* Data for dataframe =  generic-food *************

        FOOD NAME                 SCIENTIFIC NAME             GROUP  \
0        Angelica                Angelica keiskei  Herbs and Spices
1   Savoy cabbage  Brassica oleracea var. sabauda        Vegetables
2   Silver linden                  Tilia argentea  Herbs and Spices
3            Kiwi             Actinidia chinensis            Fruits
4  Allium (Onion)                          Allium        Vegetables

                 SUB GROUP
0                    Herbs
1                 Cabbages
2                    Herbs
3          Tropical fruits
4  Onion-family vegetables

### Part 2: Pandas DataFrame to SQL

The following cell is an implementation template for a function that will create a table for a data frame and load the data into the table.
Answer

- You must create a connection.

In [73]:
# The admin ID you chose when creating the instance.
rds_user = ""

# The host name that you copied from AWS console into DataGrip
rds_host = ""

# This is standard. Do not worry about it.
rds_port = 3306

# The password for your admin ID.
rds_password = ""

In [74]:
from sqlalchemy import create_engine


db_data = 'mysql+pymysql://' + rds_user + ':' + rds_password + '@' + rds_host + ':'+ str(rds_port) +'/'
engine = create_engine(db_data)
engine

Engine(mysql+pymysql://admin:***@ara-project.ckkqqktwkcji.us-east-1.rds.amazonaws.com:3306/)

- This creates a new schema for your CSV files

In [53]:
schema = "Foods"
sql = "create schema " + schema
cursor = conn.cursor()
cnt = cursor.execute(sql)
res = cursor.fetchall()
res

()

- You need to read the DataFrames you made to SQL, you should be able to do this in one line

In [55]:
#HINT: you will need the "engine" that was created and the name of the schema you are connecting to
for table_name, data_frame in dfs.items():
    
    ##### Your Code Goes Here #####
    

    
    
    ##### End Your Code #####
    print("Created and loaded table = ", table_name)

Created and loaded table =  flavors
Created and loaded table =  generic-food

<u>Tests</u>

- The following cell displays the first five rows from the `generic-foods` table.
- You should also check your SQL server on DataGrip and see if you can see your new schema and tables!

In [62]:
sql = "select * from Foods.`generic-food` limit 5"
cursor = conn.cursor()
cnt = cursor.execute(sql)
res = cursor.fetchall()
res

[{'index': 0,
  'FOOD NAME': 'Angelica',
  'SCIENTIFIC NAME': 'Angelica keiskei',
  'GROUP': 'Herbs and Spices',
  'SUB GROUP': 'Herbs'},
 {'index': 1,
  'FOOD NAME': 'Savoy cabbage',
  'SCIENTIFIC NAME': 'Brassica oleracea var. sabauda',
  'GROUP': 'Vegetables',
  'SUB GROUP': 'Cabbages'},
 {'index': 2,
  'FOOD NAME': 'Silver linden',
  'SCIENTIFIC NAME': 'Tilia argentea',
  'GROUP': 'Herbs and Spices',
  'SUB GROUP': 'Herbs'},
 {'index': 3,
  'FOOD NAME': 'Kiwi',
  'SCIENTIFIC NAME': 'Actinidia chinensis',
  'GROUP': 'Fruits',
  'SUB GROUP': 'Tropical fruits'},
 {'index': 4,
  'FOOD NAME': 'Allium (Onion)',
  'SCIENTIFIC NAME': 'Allium',
  'GROUP': 'Vegetables',
  'SUB GROUP': 'Onion-family vegetables'}]

# Part D: Data Clean Up

## Please note: You MUST make a new schema using the lahmansdb_to_clean.sql file provided in the data folder. 

Use thelahmansdb_to_clean.sql file to make a new schema containing the raw data. The lahman database you created in Homework 0 has already been cleaned with all the constraints and will be used for Part E. Knowing how to clean data and add integrity constraints is very important which is why you go through the steps in part D. 

TLDR: If you use the HW0 lahman schema for this part you will get a lot of errors and recieve a lot of deductions.

In [63]:
# You will need to follow instructions from HW 0 to make a new schema, import the data. 
# Connect to the unclean schema below by setting the database host, user ID and password.
%load_ext sql
%sql mysql+pymysql://dbuser:dbuserdbuser@localhost/lahmansdb_to_clean

**You must also create a new engine to connect to lahmansdb_to_clean database using sqlalchemy. All of the code you need for this is found in Part C**

In [ ]:
# Specify parameters

In [ ]:
# Make your new engine here


Data cleanup: For each table we want you to clean, we have provided a list of changes you have to make. You can reference the cleaned lahman db for inspiration and guidance, but know that there are different ways to clean the data and you will be graded for your choice rationalization. You should make these changes through the DataGrip table editor, using sql queries, or pandas. In this part you will clean two tables: People, Batting and Teams. We specify with each question whether to use SQL or pandas.


### You must have: 
- A brief explanation of why we asked you to make each change
- What change you made to the table
- Any queries you used to make the changes, either the ones you wrote or the Alter statements provided by SQL workbench's table editor. 
- Executed the test statements we provided
- The cleaned table's new create statement (after you finish all the changes) 

### Overview of Changes:

People Table 

   0. Primary Key (Explanation is given, but you still must add the key to your table yourself)
   1. Empty strings to NULLs - SQL
   2. Column typing - SQL
   3. isDead column - Pandas
   4. deathDate and birthDate column - Pandas

Batting Table

   1. Empty strings to NULLs - SQL
   2. Column typing - SQL
   3. Primary Key - SQL
   4. Foreign Key - SQL
   
Teams Table

   1. Empty strings to NULLs - SQL
   2. Column typing - SQL
   3. Primary Key - SQL
   4. Foreign Key - SQL


   
### How to make the changes: 

__Using the Table Editor:__

When you hit apply, a popup will open displaying the ALTER statments sql generates. Copy the sql provided first and paste it into this notebook. Then you can apply the changes. This means that you are NOT executing the ALTER statements through your notebook. 


1. Right click on the table > Modify Table...
<img src="modify.png" width="400" height="800">



2. Keys > press the + button > input the parameters > Execute 
    OR Keys > press the + button > input the parameters > copy and paste the script generated under "SQL Script" and paste into your notebook > Run the cell in jupyter notebook
<img src="pk.png" width="600" height="1200">



3. To paste the "Create Table Statement": Right click on the table > SQL Scripts > Generate DDL to Clipboard
<img src="create.png" width="1200" height="600">

__Using sql queries:__

Copy paste any queries that you write manually into the notebook as well!


<hr style="height:2px">

## People Table

### 0) EXAMPLE: Add a Primary Key 

(Solutions are given but make sure you still do this step in workbench!)

#### Explanation

We want to add a Primary Key because we want to be able to uniquely identify rows within our data. A primary key is also an index, which allows us to locate data faster.

#### Change

I added a Primary Key on the playerID column and made the datatype VARCHAR(15)

#### SQL

~~~~sql
ALTER TABLE `lahmansdb_to_clean`.`people`
CHANGE COLUMN `playerID` `playerID` VARCHAR(15) NOT NULL ,
ADD PRIMARY KEY (`playerID`);
~~~~

#### Tests

In [2]:
%sql SHOW KEYS FROM people WHERE Key_name = 'PRIMARY'

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
1 rows affected.

[('people', 0, 'PRIMARY', 1, 'playerID', 'A', 19539, None, None, '', 'BTREE', '', '', 'YES', None)]

### 1) SQL: Convert all empty strings to NULL

#### Explanation

_Put your answer in this cell_

#### Change

_Put your answer in this cell_

#### SQL

~~~~sql
Put your answer in this cell
~~~~

#### Tests

In [5]:
%sql SELECT * FROM people WHERE birthState = ""

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.

[]

### 2) SQL: Change column datatypes to appropriate values (ENUM, INT, VARCHAR, DATETIME, ETC)

#### Explanation

_Put your answer in this cell_

#### Change

_Put your answer in this cell_

#### SQL

~~~~sql
Put your answer in this cell
~~~~

### 3) Pandas: Add an isDead Column that is either 'Y' or 'N'
Some things to think of: What data type should this column be? How do you know if the player is dead or not?

'Y' means the player is dead

'N' means the player is alive

#### Explanation

_Put your answer in this cell_

#### Change

_Put your answer in this cell_

#### Pandas

In [ ]:
# Read in SQL table
df = pandas.read_sql("select * from people;", engine)

    ##### Your Code Goes Here #####
    
    
    ##### End Your Code #####

# Send updated dataframcedata back to sql
df.to_sql("people", engine, if_exists="replace")

#### Tests

In [6]:
%sql SELECT * FROM people WHERE isDead = "N" limit 10

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
10 rows affected.

[('aardsda01', '1981', '12', '27', 'USA', 'CO', 'Denver', None, None, None, None, None, None, 'David', 'Aardsma', 'David Allan', 215, '75', 'R', 'R', '2004-04-06', '2015-08-23', 'aardd001', 'aardsda01', datetime.datetime(1981, 12, 27, 0, 0), None, 'N'),
 ('aaronha01', '1934', '2', '5', 'USA', 'AL', 'Mobile', None, None, None, None, None, None, 'Hank', 'Aaron', 'Henry Louis', 180, '72', 'R', 'R', '1954-04-13', '1976-10-03', 'aaroh101', 'aaronha01', datetime.datetime(1934, 2, 5, 0, 0), None, 'N'),
 ('aasedo01', '1954', '9', '8', 'USA', 'CA', 'Orange', None, None, None, None, None, None, 'Don', 'Aase', 'Donald William', 190, '75', 'R', 'R', '1977-07-26', '1990-10-03', 'aased001', 'aasedo01', datetime.datetime(1954, 9, 8, 0, 0), None, 'N'),
 ('abadan01', '1972', '8', '25', 'USA', 'FL', 'Palm Beach', None, None, None, None, None, None, 'Andy', 'Abad', 'Fausto Andres', 184, '73', 'L', 'L', '2001-09-10', '2006-04-13', 'abada001', 'abadan01', datetime.datetime(1972, 8, 25, 0, 0), None, 'N'),
 ('abadfe01', '1985', '12', '17', 'D.R.', 'La Romana', 'La Romana', None, None, None, None, None, None, 'Fernando', 'Abad', 'Fernando Antonio', 220, '73', 'L', 'L', '2010-07-28', '2017-10-01', 'abadf001', 'abadfe01', datetime.datetime(1985, 12, 17, 0, 0), None, 'N'),
 ('abbotgl01', '1951', '2', '16', 'USA', 'AR', 'Little Rock', None, None, None, None, None, None, 'Glenn', 'Abbott', 'William Glenn', 200, '78', 'R', 'R', '1973-07-29', '1984-08-08', 'abbog001', 'abbotgl01', datetime.datetime(1951, 2, 16, 0, 0), None, 'N'),
 ('abbotje01', '1972', '8', '17', 'USA', 'GA', 'Atlanta', None, None, None, None, None, None, 'Jeff', 'Abbott', 'Jeffrey William', 190, '74', 'R', 'L', '1997-06-10', '2001-09-29', 'abboj002', 'abbotje01', datetime.datetime(1972, 8, 17, 0, 0), None, 'N'),
 ('abbotji01', '1967', '9', '19', 'USA', 'MI', 'Flint', None, None, None, None, None, None, 'Jim', 'Abbott', 'James Anthony', 200, '75', 'L', 'L', '1989-04-08', '1999-07-21', 'abboj001', 'abbotji01', datetime.datetime(1967, 9, 19, 0, 0), None, 'N'),
 ('abbotku01', '1969', '6', '2', 'USA', 'OH', 'Zanesville', None, None, None, None, None, None, 'Kurt', 'Abbott', 'Kurt Thomas', 180, '71', 'R', 'R', '1993-09-07', '2001-04-13', 'abbok002', 'abbotku01', datetime.datetime(1969, 6, 2, 0, 0), None, 'N'),
 ('abbotky01', '1968', '2', '18', 'USA', 'MA', 'Newburyport', None, None, None, None, None, None, 'Kyle', 'Abbott', 'Lawrence Kyle', 200, '76', 'L', 'L', '1991-09-10', '1996-08-24', 'abbok001', 'abbotky01', datetime.datetime(1968, 2, 18, 0, 0), None, 'N')]

### 4) Pandas: Add a deathDate and birthDate column
Some things to think of: What do you do if you are missing information? What datatype should this column be?

#### Explanation

_Put your answer in this cell_

#### Change

_Put your answer in this cell_

### Pandas

In [ ]:
# Read in SQL table
df = pandas.read_sql("select * from people;", engine)

    ##### Your Code Goes Here #####
    
    
    ##### End Your Code #####

# Send updated dataframcedata back to sql
df.to_sql("people", engine, if_exists="replace")

#### Tests

In [9]:
%sql SELECT deathDate FROM people WHERE deathDate >= '2005-01-01' ORDER BY deathDate ASC LIMIT 10;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
10 rows affected.

[(datetime.datetime(2005, 1, 4, 0, 0),),
 (datetime.datetime(2005, 1, 7, 0, 0),),
 (datetime.datetime(2005, 1, 9, 0, 0),),
 (datetime.datetime(2005, 1, 10, 0, 0),),
 (datetime.datetime(2005, 1, 21, 0, 0),),
 (datetime.datetime(2005, 1, 22, 0, 0),),
 (datetime.datetime(2005, 1, 31, 0, 0),),
 (datetime.datetime(2005, 2, 4, 0, 0),),
 (datetime.datetime(2005, 2, 8, 0, 0),),
 (datetime.datetime(2005, 2, 11, 0, 0),)]

In [10]:
%sql SELECT birthDate FROM people WHERE birthDate <= '1965-01-01' ORDER BY birthDate ASC LIMIT 10;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
10 rows affected.

[(datetime.datetime(1820, 4, 17, 0, 0),),
 (datetime.datetime(1824, 10, 5, 0, 0),),
 (datetime.datetime(1832, 2, 25, 0, 0),),
 (datetime.datetime(1832, 9, 17, 0, 0),),
 (datetime.datetime(1832, 10, 23, 0, 0),),
 (datetime.datetime(1835, 1, 10, 0, 0),),
 (datetime.datetime(1836, 2, 29, 0, 0),),
 (datetime.datetime(1837, 12, 26, 0, 0),),
 (datetime.datetime(1838, 3, 10, 0, 0),),
 (datetime.datetime(1838, 7, 16, 0, 0),)]

### Final CREATE Statement

To find the create statement:

- Right click on the table name in workbench
- Select 'Copy to Clipboard'
- Select 'Create Statement' 

The create statement will now be copied into your clipboard and can be pasted into the cell below.

~~~~sql
Put your answer in this cell
~~~~

<hr style="height:2px">

## Batting Table

### 1) SQL: Convert all empty strings to NULL

#### Explanation

_Put your answer in this cell_

#### Change

_Put your answer in this cell_

#### SQL

~~~~sql
Put your answer in this cell
~~~~

#### Tests

In [11]:
%sql SELECT count(*) FROM lahman2019clean.batting where RBI is NULL;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
1 rows affected.

[(756,)]

### 2) SQL: Change column datatypes to appropriate values (ENUM, INT, VARCHAR, DATETIME, ETC)

#### Explanation

_Put your answer in this cell_

#### Change

_Put your answer in this cell_

#### SQL

~~~~sql
Put your answer in this cell
~~~~

### 3) SQL: Add a Primary Key
Two options for the Primary Key:

- Composite Key: playerID, yearID, stint
- Covering Key: playerID, yearID, stint, teamID


#### Choice

_Put your answer in this cell_

#### Explanation

_Put your answer in this cell_

#### SQL

~~~~sql
Put your answer in this cell
~~~~

#### Test

In [33]:
%sql SHOW KEYS FROM batting WHERE Key_name = 'PRIMARY' and Column_name = 'playerID'

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
1 rows affected.

[('batting', 0, 'PRIMARY', 1, 'playerID', 'A', 20242, None, None, '', 'BTREE', '', '', 'YES', None)]

### 4) SQL: Add a foreign key on playerID between the People and Batting Tables
Note: Two people in the batting table do not exist in the people table. How should you handle this issue?

#### Explanation

_Put your answer in this cell_

#### Change

_Put your answer in this cell_

#### SQL

~~~~sql
Put your answer in this cell
~~~~

#### Tests

In [12]:
%sql Select playerID from batting where playerID not in (select playerID from people);

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.

[]

### Final CREATE Statement

To find the create statement:

- Right click on the table name in workbench
- Select 'Copy to Clipboard'
- Select 'Create Statement' 

The create statement will now be copied into your clipboard and can be pasted into the cell below.

~~~~sql
Put your answer in this cell
~~~~

## Teams Table

### 1) SQL: Convert all empty strings to NULL

#### Explanation

_Put your answer in this cell_

#### Change

_Put your answer in this cell_

#### SQL

~~~~sql
Put your answer in this cell
~~~~

#### Tests

In [20]:
%sql select * from teams where divID is NULL limit 10;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
10 rows affected.

[('1884', 'UA', 'ALT', 'ALT', None, 10, 25, '', '6', '19', '', '', 'N', '', '90', '899', '223', '30', '6', '2', '22', '130', '', '', '', '', '216', '114', '4.67', '20', '0', '0', '659', '292', '3', '52', '93', '156', '4', '0.862', 'Altoona Mountain City', '', '', '101', '109', 'ALT', 'ALT', 'ALT'),
 ('1966', 'NL', 'ATL', 'ATL', None, 5, 163, '82', '85', '77', '', '', 'N', 'N', '782', '5617', '1476', '220', '32', '207', '512', '913', '59', '47', '', '', '683', '601', '3.68', '37', '10', '36', '4407', '1430', '129', '485', '884', '154', '139', '0.976', 'Atlanta Braves', 'Atlanta-Fulton County Stadium', '1539801', '103', '102', 'ATL', 'ATL', 'ATL'),
 ('1967', 'NL', 'ATL', 'ATL', None, 7, 162, '81', '77', '85', '', '', 'N', 'N', '631', '5450', '1307', '191', '29', '158', '512', '947', '55', '45', '', '', '640', '561', '3.47', '35', '5', '32', '4362', '1377', '118', '449', '862', '138', '148', '0.978', 'Atlanta Braves', 'Atlanta-Fulton County Stadium', '1389222', '99', '99', 'ATL', 'ATL', 'ATL'),
 ('1968', 'NL', 'ATL', 'ATL', None, 5, 163, '81', '81', '81', '', '', 'N', 'N', '514', '5552', '1399', '179', '31', '80', '414', '782', '83', '44', '', '', '549', '478', '2.92', '44', '16', '29', '4422', '1326', '87', '362', '871', '125', '139', '0.980', 'Atlanta Braves', 'Atlanta-Fulton County Stadium', '1126540', '101', '101', 'ATL', 'ATL', 'ATL'),
 ('1954', 'AL', 'BAL', 'BAL', None, 7, 154, '77', '54', '100', '', '', 'N', 'N', '483', '5206', '1309', '195', '49', '52', '468', '634', '30', '31', '', '', '668', '592', '3.88', '58', '6', '8', '4119', '1279', '78', '688', '668', '147', '152', '0.975', 'Baltimore Orioles', 'Memorial Stadium', '1060910', '92', '96', 'BAL', 'BAL', 'BAL'),
 ('1955', 'AL', 'BAL', 'BAL', None, 7, 156, '79', '57', '97', '', '', 'N', 'N', '540', '5257', '1263', '177', '39', '54', '560', '742', '34', '46', '', '', '754', '649', '4.21', '35', '10', '20', '4164', '1403', '103', '625', '595', '162', '159', '0.973', 'Baltimore Orioles', 'Memorial Stadium', '852039', '92', '96', 'BAL', 'BAL', 'BAL'),
 ('1956', 'AL', 'BAL', 'BAL', None, 6, 154, '77', '69', '85', '', '', 'N', 'N', '571', '5090', '1242', '198', '34', '91', '563', '725', '39', '42', '', '', '705', '635', '4.2', '38', '10', '24', '4080', '1362', '99', '547', '715', '133', '142', '0.977', 'Baltimore Orioles', 'Memorial Stadium', '901201', '92', '94', 'BAL', 'BAL', 'BAL'),
 ('1957', 'AL', 'BAL', 'BAL', None, 5, 154, '77', '76', '76', '', '', 'N', 'N', '597', '5264', '1326', '191', '39', '87', '504', '699', '57', '35', '', '', '588', '541', '3.46', '44', '13', '25', '4224', '1272', '95', '493', '767', '109', '159', '0.982', 'Baltimore Orioles', 'Memorial Stadium', '1029581', '93', '94', 'BAL', 'BAL', 'BAL'),
 ('1958', 'AL', 'BAL', 'BAL', None, 6, 154, '78', '74', '79', '', '', 'N', 'N', '521', '5111', '1233', '195', '19', '108', '483', '731', '33', '35', '', '', '575', '517', '3.4', '55', '15', '28', '4107', '1277', '106', '403', '749', '114', '159', '0.980', 'Baltimore Orioles', 'Memorial Stadium', '829991', '94', '95', 'BAL', 'BAL', 'BAL'),
 ('1959', 'AL', 'BAL', 'BAL', None, 6, 155, '78', '74', '80', '', '', 'N', 'N', '551', '5208', '1240', '182', '23', '109', '536', '690', '36', '24', '', '', '621', '554', '3.56', '45', '15', '30', '4200', '1290', '111', '476', '735', '147', '163', '0.976', 'Baltimore Orioles', 'Memorial Stadium', '891926', '97', '98', 'BAL', 'BAL', 'BAL')]

### 2) SQL: Change column datatypes to appropriate values (ENUM, INT, VARCHAR, DATETIME, ETC)

#### Explanation

_Put your answer in this cell_

#### Change

_Put your answer in this cell_

#### SQL

~~~~sql
Put your answer in this cell
~~~~

### 3) SQL: Add a Primary Key


#### Explanation

_Put your answer in this cell_

#### Change

_Put your answer in this cell_

#### SQL

~~~~sql
Put your answer in this cell
~~~~

#### Tests

In [37]:
%sql SHOW KEYS FROM teams WHERE Key_name = 'PRIMARY' and column_name = 'teamID'

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
1 rows affected.

[('teams', 0, 'PRIMARY', 1, 'teamID', 'A', 143, None, None, '', 'BTREE', '', '', 'YES', None)]

### Final CREATE Statement

To find the create statement:

- Right click on the table name in workbench
- Select 'Copy to Clipboard'
- Select 'Create Statement' 

The create statement will now be copied into your clipboard and can be pasted into the cell below.

~~~~sql
Put your answer in this cell
~~~~

### 4) SQL: Add a foreign key on teamID between the Team and Batting Tables

#### Explanation

_Put your answer in this cell_

#### Change

_Put your answer in this cell_

#### SQL

~~~~sql
Put your answer in this cell
~~~~

#### Tests

Write your own sql statement to test the creation of the foreign key.

# Part E: SQL Queries


NOTE: For these queries, you must connect to and use the CLEAN lahman database that we provided in hw0. This will ensure your solutions are consistent with the answers.

In [2]:
%reload_ext sql
%sql mysql+pymysql://root:dbuserdbuser@localhost/lahmansbaseballdb

## Question 0
What is the average salary in baseball history?

In [ ]:
%%sql #PUT YOUR ANSWER IN THIS CELL

 * mysql+pymysql://root:***@localhost/lahmansbaseballdb
1 rows affected.

[(2085634.053125473,)]

## Question 1
Select the players with a first name of Sam who were born in the United States and attended college.

Include their first name, last name, playerID, school ID, yearID and birth state.
Limit 10

<i> Hint: Use a Join between People and CollegePlaying </i>

In [7]:
%%sql #PUT YOUR ANSWER IN THIS CELL

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
2 rows affected.

[]

In [6]:
%%sql

 * mysql+pymysql://root:***@localhost/lahmansbaseballdb
10 rows affected.

[('Sam', 'Barnes', 'barnesa01', 'auburn', 1918, 'AL'),
 ('Sam', 'Barnes', 'barnesa01', 'auburn', 1919, 'AL'),
 ('Sam', 'Barnes', 'barnesa01', 'auburn', 1920, 'AL'),
 ('Sam', 'Barnes', 'barnesa01', 'auburn', 1921, 'AL'),
 ('Sam', 'Bowens', 'bowensa01', 'tennst', 1956, 'NC'),
 ('Sam', 'Bowens', 'bowensa01', 'tennst', 1957, 'NC'),
 ('Sam', 'Bowens', 'bowensa01', 'tennst', 1958, 'NC'),
 ('Sam', 'Bowen', 'bowensa02', 'gacoast', 1971, 'GA'),
 ('Sam', 'Bowen', 'bowensa02', 'gacoast', 1972, 'GA'),
 ('Sam', 'Brown', 'brownsa01', 'grovecity', 1899, 'PA')]

## Question 2
Update all entries with full_name Columbia University to 'Columbia University in the City of New York' in the Schools table. Then select the row.

In [ ]:
%%sql #PUT YOUR ANSWER IN THIS CELL

In [18]:
%sql

 * mysql+pymysql://root:***@localhost/lahmansbaseballdb
1 rows affected.

[]

In [19]:
%sql select * from schools where schoolID="columbia"

 * mysql+pymysql://root:***@localhost/lahmansbaseballdb
1 rows affected.

[('columbia', 'Columbia University in the City of New York', 'New York', 'NY', 'USA')]

## Question 3

Find the playerID, awardID, yearID, lgID, death_date, and G_all for Ted Williams (willite01) in 1939.

You will need to use the appearances, awardsplayers and people tables

In [ ]:
%%sql #PUT YOUR ANSWER IN THIS CELL

In [7]:
%%sql

 * mysql+pymysql://root:***@localhost/lahmansbaseballdb
3 rows affected.

[('willite01', 'Baseball Magazine All-Star', 1939, 'AL', datetime.date(2002, 7, 5), 149),
 ('willite01', 'Baseball Magazine All-Star', 1939, 'ML', datetime.date(2002, 7, 5), 149),
 ('willite01', 'TSN All-Star', 1939, 'ML', datetime.date(2002, 7, 5), 149)]

## Question 4

Find the highest salaries for players born after 1970. Order alphabetically. Limit 10.

<u>Answer:</u>

In [ ]:
%%sql #PUT YOUR ANSWER IN THIS CELL

#### Expected output

In [14]:
%%sql

 * mysql+pymysql://root:***@localhost/lahmansbaseballdb
10 rows affected.

[(421000.0, 'ellisaj01', 'A. J.', 'Ellis'),
 (490000.0, 'ellisaj01', 'A. J.', 'Ellis'),
 (2000000.0, 'ellisaj01', 'A. J.', 'Ellis'),
 (3550000.0, 'ellisaj01', 'A. J.', 'Ellis'),
 (4250000.0, 'ellisaj01', 'A. J.', 'Ellis'),
 (4500000.0, 'ellisaj01', 'A. J.', 'Ellis'),
 (170000.0, 'hinchaj01', 'A. J.', 'Hinch'),
 (230000.0, 'hinchaj01', 'A. J.', 'Hinch'),
 (260000.0, 'hinchaj01', 'A. J.', 'Hinch'),
 (260000.0, 'hinchaj01', 'A. J.', 'Hinch')]

## Question 5
Find the personal best salary for players who were born after 1980.
Order by largest to smallest salary. 
Limit 10.

In [ ]:
%%sql #PUT YOUR ANSWER IN THIS CELL

In [20]:
%%sql

 * mysql+pymysql://root:***@localhost/lahmansbaseballdb
10 rows affected.

[(33000000.0, 'kershcl01', 'Clayton', 'Kershaw'),
 (31799030.0, 'greinza01', 'Zack', 'Greinke'),
 (30000000.0, 'priceda01', 'David', 'Price'),
 (28000000.0, 'verlaju01', 'Justin', 'Verlander'),
 (28000000.0, 'cabremi01', 'Miguel', 'Cabrera'),
 (27328046.0, 'cespeyo01', 'Yoenis', 'Cespedes'),
 (25857143.0, 'hernafe02', 'Felix', 'Hernandez'),
 (25000000.0, 'lestejo01', 'Jon', 'Lester'),
 (24000000.0, 'canoro01', 'Robinson', 'Cano'),
 (24000000.0, 'fieldpr01', 'Prince', 'Fielder')]